# Строки локализации

## Шапка страницы
open-menu = Открыть меню
homepage = Главная страница
dashboard = Панель управления
type-slash-to-search = Нажмите {{kbd}}, чтобы искать
command-palette = Палитра команд
chat-with-copilot = Перейти к общению с Копайлотом
open-agents-panel = Открыть агентную панель
create-new = Создание
your-issues = Ваши темы
issues = Темы
your-pull-requests = Ваши запросы на слияние
pull-requests = Запросы на слияние
repositories = Репозитории
you-have-no-notifications = У вас нет непрочитанных уведомлений
open-user-navigation-menu = Открыть навигационное меню пользователя

## Левая колонка страницы 1
home = Главная страница

## Приветствия по времени суток
good-night = Доброй ночи
good-morning = Доброе утро
good-afternoon = Добрый день
good-evening = Добрый вечер

## Предварительная версия дизайна
preview = Предварительная версия
feedback = Обратная связь
give-feedback = Оставить отзыв

## Левая колонка страницы 2
feed = Лента событий

## Блок «Образования с Гитхабом» 1
learn-collaborate-grow = Учитесь. Кооперируйтесь. Развивайтесь

## Окно Копайлота 1
ask-anything = Спросите что угодно

## Блок «Образования с Гитхабом» 2
github-education-gives-here = «GitHub Education» предоставляет инструменты и поддержку сообщества, чтобы вы могли принимать технологические вызовы и превращать их в возможности. Ваше технологическое будущее начинается здесь!

## Левая колонка страницы 2
top-repositories = Релевантные репозитории
search-for-repositories = Искать репозитории

## Окно Копайлота 2
add-repositories-files-spaces = Добавить репозиторий, файл или пространство
ask = Просьба
task = Задача
send-now = Отправить прямо сейчас

## Блок «Образования с Гитхабом» 3
go-to-github-education = Перейти в «GitHub Education»

## Окно Копайлота 3
cw3-task = Создать задачу
new = Новинка
create-issue = Создать тему
spark = Блеснуть

## Агентные сессии 1
agent-sessions = Агентные сессии
agent-sessions-options = Параметры агентных сессий

## Список изменений Гитхаба 1
latest-from-our-changelog = Последнее с нашего списка изменений

## Форматы дат
month-short-jan = янв.
month-short-feb = февр.
month-short-mar = мар.
month-short-apr = апр.
month-short-may = мая
month-short-jun = июн.
month-short-jul = июл.
month-short-aug = авг.
month-short-sep = сент.
month-short-oct = окт.
month-short-nov = нояб.
month-short-dec = дек.

month-long-january = января
month-long-february = февраля
month-long-march = марта
month-long-april = апреля
month-long-may = мая
month-long-june = июня
month-long-july = июля
month-long-august = августа
month-long-september = сентября
month-long-october = октября
month-long-november = ноября
month-long-december = декабря

timezone-msk = по МСК

## Агентные сессии 2
no-sessions-found = Сессий не найдено. Попробуйте другой фильтр или [link]начните новую сессию[/link].
unable-to-load-agent = Не удалось загрузить агентные задачи. Попробуйте вернуться позже.

## Блок запросов на слияние 1
open-in-copilot-chat = Закрепить в разговоре с Копайлотом
## Некогда здесь была «pull-requests = Запросы на слияние»
view-all = Посмотреть все
pull-request-options = Параметры запроса на слияние
number-sign = №
opened-by = Подан
pr-updated = Отредактирован

## Левая колонка страницы 3
show-more = Показать больше

## Блок запросов на слияние 2
created-on = Создан

## Список изменений Гитхаба 2
view-changelog = Смотреть список изменений →

## Блок тем 1
## Некогда здесь была «issues = Темы»
issue-options = Параметры темы
assign-to-copilot = Делегировать Копайлоту
issue-opened-by = Открыта
issue-updated = Отредактирована
issue-created-on = Создана

## Подвал
copyright-2025 = © 2025 компания GitHub
terms = Условия использования
privacy = Политика конфиденциальности
security = О безопасности
status = Состояние
community = Сообщество
docs = Документация
contact = Связаться
manage-cookies = Настроить использование куки
do-not-share-info = Не делитесь моей личной информацией

## Левое боковое меню
close-menu = Закрыть меню
projects = Проекты
discussions = Обсуждения
codespaces = Кодовые пространства
copilot = Копайлот
explore = Обзор
marketplace = Магазин
mcp-registry = Реестр MCP

## Поиск
owners = Владельцы
jump-to = Перейти
## Здесь была «repositories = Репозитории»
chat-with-copilot = Написать Копайлоту
start-copilot-thread = Начать новую беседу с Копайлотом
search-syntax-tips = Статья о синтаксисе поиска
switch-back = Переключиться обратно

## Палитра команд
search-or-jump = Искать или сразу куда-то перейти…
tip = Подсказка:
go-to-accessibility-settings = перейдите в настройки доступности, чтобы перенастроить горячие клавиши
type-at-to-search = нажмите [kbd]@[/kbd], чтобы искать среди людей и организаций
type-gt-to-command = нажмите [kbd]>[/kbd], чтобы активировать режим команд
type-hash-to-issues = нажмите [kbd]#[/kbd], чтобы искать среди тем
type-hash-to-prs = нажмите [kbd]#[/kbd], чтобы искать среди запросов на слияние
type-question-for-help = Нажмите [kbd]?[/kbd], чтобы получить справку и подсказки
pages = Страницы
notifications = Уведомления
users = Пользователи
enter-to-jump-tab-to-search = [kbd]Клавиша ввода (Enter)[/kbd] — переход, [kbd]клавиша табуляции (Tab)[/kbd] — поиск

## Агентная панель
agents = Агенты
branch = Ветка
agent = Агент
auto = Автовыбор
select-custom-agent = Выбрать своего агента
start-task = Запустить выполнение задачи
start-new-task-copilot = Начните новую задачу с Копайлотом
tasks-couldnt-be-loaded = Задачи не могут быть загружены
copilot-task-description = Опишите задачу на разговорном языке. Копайлот начнёт работу в фоновом режиме и подаст запрос на слияние, ожидая вашего рассмотрения.
try-again-or = Попробуйте вернуться позже, либо, если проблема останется, свяжитесь со службой поддержки.
learn-more-copilot-agent = Узнать больше о кодовом агенте Копайлота
github-status = Статус GitHub
copilot-uses-ai = [link]Копайлот[/link] использует ИИ. Проверяйте наличие ошибок.

## Меню создания
new-issue = Создать новую тему
new-repository = Создать новый репозиторий
import-repository = Импортировать репозиторий
new-agent-task = Создать новую задачу для агента
new-agent-session = Начать новую агентную сессию
new-codespace = Создать новое кодовое пространство
new-gist = Создать новый джист
new-organization = Создать новую организацию
new-project = Создать новый проект

## Правая боковая панель
account-switcher = Переключатель учётных записей
profile = Профиль
stars = Звёзды
gists = Джисты
organizations = Организации
enterprises = Предприятия
sponsors = Спонсоры
settings = Настройки
copilot-settings = Настройки Копайлота
feature-preview = Тестируемые возможности
appearance = Внешний вид
accessibility = Доступность
try-enterprise = Попробовать Enterprise
free = Бесплатно
sign-out = Выйти из учётной записи

## Всплывающее меню добавления окна Копайлота
copilot-repositories = Репозиторий…
files-and-folders = Файл или папка
spaces = Пространство…
upload-from-computer = Загрузить с компьютера
extensions = Расширения…

## Всплывающее меню моделей окна Копайлота
models = Модели
fast-and-cost-efficient = Быстрые и экономичные
versatile-and-highly-intelligent = Универсальные и обладающие высоким уровнем интеллекта
most-powerful-at-complex = Наиболее мощные в решении сложных задач
you-have-used-eighty = Вы истратили 80 % премиум-запросов этого месяца. Вы можете [link]увеличить[/link] лимит.

## Всплывающее меню Git
basic-git-commands = Основные команды Git
git-branching = Ветвление в Git
advanced-git-commands = Команды Git для продвинутых пользователей

## Всплывающее меню настройки фильтрации агентных задач
agent-sessions-to-include = Агентные задачи для включения
open = Открытые
closed = Закрытые
number-of-results = Отображаемое количество

## Всплывающее меню настройки фильтрации запросов на слияние
pull-requests-to-include = Запросы на слияние для включения
authored = За моим авторством
mentioned = С моим упоминанием
review-requested = Требующие моего рассмотрения
reviewed = Рассмотренные

## Всплывающее меню настройки фильтрации тем
issues-to-include = Темы для включения
assigned-to-me = Назначенные на меня
involves-me = Включающие меня

## Меню настройки использования куки
manage-cookie-preferences = Настройте предпочтения в использовании куки
most-github-websites-use-cookies = Большинство сайтов GitHub используют файлы куки. Куки — это небольшие текстовые файлы, которые помещаются на вашем устройстве для хранения данных, чтобы веб-серверы могли использовать их позже. GitHub и наши сторонние партнёры используют куки для запоминания ваших предпочтений и настроек, помощи при авторизации, показа персонализированной рекламы и анализа того, насколько хорошо работают наши сайты. Для получения дополнительной информации читайте раздел «Куки и схожие технологии» в [link]заявлении о конфиденциальности[/link].
required = Обязательные
github-uses-required-work = GitHub использует обязательные куки для выполнения основных функций сайта и предоставления сервисов. Например, куки применяются для авторизации, сохранения языковых предпочтений, обеспечения работы корзины покупок, повышения производительности, распределения трафика между веб-серверами, определения размера экрана, измерения времени загрузки страниц, улучшения пользовательского опыта и анализа аудитории. Эти куки необходимы для работы наших сайтов.
analytics = Аналитика
we-allow-third-parties = Мы разрешаем третьим сторонам использовать аналитические файлы куки, чтобы понимать, как вы пользуетесь нашими сайтами, и улучшать их. Например, куки используются для сбора информации о посещаемых вами страницах и количестве нажатий, необходимых для выполнения задачи. Мы также используем некоторые аналитические куки для показа персонализированной рекламы. 
accept = Принять
reject = Отклонить
social-media = Социальные сети
github-and-third-github = GitHub и третьи лица используют куки социальных сетей, чтобы показывать вам рекламу и контент на основе ваших профилей в социальных сетях и активности на сайтах GitHub. Это способствует тому, чтобы реклама и контент, которые вы видите на наших сайтах и в соцсетях, лучше соответствовали вашим интересам. Кроме того, это даёт третьим лицам возможность разрабатывать и улучшать свои продукты, которые они могут использовать на сайтах, не принадлежащих и не управляемых GitHub.
advertising = Реклама
in-addition-github-history = Кроме того, GitHub и третьи лица используют рекламные куки, чтобы показывать вам новые объявления на основе тех, которые вы уже видели. Куки также отслеживают, по каким объявлениям вы нажимаете и какие покупки вы совершаете после перехода по объявлению. Это делается, чтобы показывать вам более релевантную рекламу и в коммерческих целях совместно с нашими рекламными партнёрами. Например, куки используются для определения факта нажатия по объявлению и для показа рекламы на основе ваших интересов в социальных сетях и истории просмотра сайтов.
reset-all = Сбросить всё
save-changes = Сохранить изменения

## Всплывающее меню выбора репозитория агентной панели
select-a-repository = Выберите репозиторий
